Revit 2027 API
AdvancedWood.WoodRayNumSlices Property
 The property labeled "Number of slices in xy plane" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodRayNumSlices { get; }
Public Shared ReadOnly Property WoodRayNumSlices As String
	Get
public:
static property String^ WoodRayNumSlices {
	String^ get ();
}
static member WoodRayNumSlices : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace